package lx.com.pdf.test;

public class Test {

    public static void main(String[]args){
        String str ="1.中国封建社会的主要矛盾及其特性。=(1）中国封建社会的主要矛盾，是地主阶级和农民阶级的矛盾；（2）一方面，它巩固和维系了中国封建社会的长期延续和稳定。另一方面，随着中国封建社会由盛转衰，地主阶级同农民阶级的固有矛盾日益显现出来，造成自身不可克服的政治经济社会周期性危机。\n" +
                "2.试述西方列强对中国的侵略。=(1）军事侵略：①签订不平等条约，侵占中国大片领土。②签订不平等条约，勒索巨额赔款。③掠夺财富，破坏文物和古迹。（2）政治控制：①控制中国内政，列强驻京公使成了清政府的太上皇。②操纵中国外交，控制中国外交主权。③享有领事裁判权，外国人可以在中国横行不法，中国政府无权干涉。④把持中国海关，中国海关的高级职员全部由外国人充任。⑤勾结清政府，镇压中国人民的反抗斗争。⑥扶植、收买代理人，清政府成了洋人的朝廷。（3）经济掠夺：①控制中国通商口岸。②剥夺中国关税自主权。③对华倾销商品。④对华资本输出。⑤操纵中国的经济命脉。（4）文化渗透：①宗教渗透和侵略；②为侵略中国制造舆论，大力宣扬殖民地奴化思想。③大肆宣扬“种族优劣论”。\n" +
                "3.试述近代中国社会阶级关系的变动。=(1）旧的封建统治阶级即地主阶级继续拥有大量的土地，掌握着国家政权，对人民实行专制统治，但自身有了很大变化。（2）旧的被统治阶级即农民阶级，仍是近代中国社会人数最多的被剥削阶级。农民阶级具有强烈的革命要求，是中国革命的主力军。（3）资产阶级是近代中国新产生的阶级，分为官僚买办资产阶级和民族资产阶级两部分。（4）近代中国诞生的被压迫阶级是工人阶级。\n" +
                "4.近现代中国工人阶级的特点。=(1）深受帝国主义、封建势力和资产阶级的三重压迫和剥削，革命性最强。（2）人数虽少，但相对集中，便于形成革命力量和传播先进思想。（3）主要由破产农民和家庭手工业者转化而来，同农民有着天然联系，便于结成工农联盟。\n" +
                "5.近代中国社会的主要矛盾以及矛盾的关系。=(1）帝国主义与中华民族的矛盾、封建主义与人民大众的矛盾是两对主要矛盾，而帝国主义与中华民族的矛盾，是最主要的矛盾。（2）两对矛盾之间的关系是：①当外国列强向中国发动侵略战争时，阶级矛盾降到次要地位，而民族矛盾上升到主要地位。②当外国侵略者同封建政权相勾结，共同镇压中国革命时，中国人民往往用战争的形式反对封建政权，这时阶级矛盾就上升为主要矛盾。③当国内战争发展到直接威胁帝国主义在华利益以及中国封建地主阶级统治时，这时帝国主义和国内封建主义完全公开站在一条战线上。\n" +
                "6.试述近代以来中华民族面临的两大历史任务及其相互关系。=(1）两大历史任务：求得民族独立和人民解放；实现国家繁荣富强和人民共同富裕。（2）相互关系：①区别：前者是要从根本上推翻中国半殖民地半封建社会的统治秩序，着重解决生产关系问题；后者是要改变近代中国经济、文化和社会落后的地位和状况，是要充分发展近代民族工商业，着重解决生产力问题。②联系：争取民族独立和人民解放是实现国家繁荣富强和人民共同富裕的前提条件。争取民族独立和人民解放的最终目的是使中国走向现代化，实现国家繁荣富强和人民的共同富裕，使中华民族自立于世界民族之林。\n" +
                "7.19世纪末帝国主义列强瓜分中国的图谋未能实现的主要原因。=(1）帝国主义列强之间的矛盾和相互制约，是一个重要原因。瓜分中国变中国为自已的殖民地是外国列强学员专用 请勿外泄2中公学员内部专用的共同图谋，但是彼此之间又有许多矛盾、冲突，甚至可能爆发战争。因此，列强经过协商，保全清政府，以使其成为统治中国的工具，实行“以华制华”；（2）中国人民进行了不屈不挠的反侵略斗争是最根本原因。在义和团反帝爱国运动期间，中国人民以其不畏强暴，敢与敌人血战到底的气魄，打击了侵略者，使他们不敢为所欲为地瓜分中国。一个基本的历史事实不容抹杀：义和团运动在粉碎外国列强瓜分中国的斗争中，发挥了重大作用，遏制了侵略者瓜分中国的图谋。\n" +
                "8.旧民主主义时期中国人民反侵略斗争失败的原因是什么？=(1）社会制度的腐败，这是最根本的原因；（2）经济技术的落后。第二章 对国家出路的早期探索\n" +
                "1.《资政新篇》的内容。=(1）政治上，加强中央集权，学习西方，制定法律；（2）经济上，发展近代工业，吸收科学技术；（3）文化上，设新闻官，改革弊政，兴办福利事业；（4）外交上，主张同世界各国交往、通商；强调允许外国人为天国献策，但不得毁谤国法。\n" +
                "2.简述太平天国的历史意义。=(1）沉重打击封建统治阶级，强烈撼动了清政府的统治根基；（2）它是中国旧式农民起义的最高峰，具有了不同于以往农民战争的新的历史特点；（3）太平天国对孔子及儒家经典严厉批判，在一定程度上削弱了封建统治的精神支柱；（4）太平天国农民战争有力地打击了外国势力，维护了中国主权；（5）在19世纪中叶的亚洲民族解放运动中，太平天国农民战争和其他亚洲国家的民族解放运动汇合在一起，冲击了西方殖民主义在亚洲的统治。\n" +
                "3.简述太平天国失败的原因和教训。=(1）根本原因是缺乏先进阶级的领导。（2）还在于没有科学理论的指导。（3）对外国资本主义列强缺乏理性的认识。（4）教训是：在半殖民地半封建社会，农民具有伟大的革命力量，但不能担负起领导反帝反封建斗争取得胜利的重任。\n" +
                "4.简述洋务运动的指导思想以及洋务派兴办洋务的主要内容。=(1）指导思想：冯桂芬提出的“中学为体，西学为用”。（2）内容：①兴办近代企业。②建立新式海陆军。③创办新式学堂、派遣留学生。\n" +
                "5.洋务运动的历史作用。=(1）在客观上促进了中国早期工业和民族资本主义的发展；（2）成为中国近代教育的开端；（3）传播了新知识，打开了人们的眼界；（4）引起了社会风气和价值观念的变化。\n" +
                "6.洋务运动失败的原因。=(1）洋务运动具有封建性。（2）洋务运动对西方列强具有依赖性。（3）洋务企业的管理具有腐朽性。\n" +
                "7.试论维新派和守旧派论战的内容以及实质和意义。=(1）内容：①要不要变法。②要不要兴民权、设议院，实行君主立宪。③要不要废八股、改科举和兴学堂。（2）实质是资产阶级思想与封建主义思想在中国的第一次正面交锋。（3）意义是进一步开阔了新型知识分子的眼界，为维新变法运动作了思想舆论的准备。\n" +
                "8.试述戊戌维新失败的原因和教训。=(1）主要原因：维新派自身的局限和以慈禧太后为首的强大的守旧势力的反对。（2）自身弱点和局限性（自身原因）：①不敢否定封建主义；②对帝国主义抱有幻想；③脱离人民群众。第三章 辛亥革命\n" +
                "1.试述孙中山三民主义的内容和意义。=(1）主要内容：①民族主义，包括“驱除鞑虏，恢复中华”。一是以革命手段推翻清王朝，二是变“次殖民地”的中国为独立的中国。②民权主义即“创立民国”，指推翻封建君主专制制度，建立资产阶级民主共和国。③民生主义指“平均地权”，基本方案是：核定地价，按价征税，涨价归公，按价收买。（2）意义：这是一个比较学员专用 请勿外泄3中公学员内部专用完备的民主主义的革命纲领，推动了革命思想的传播和革命运动的发展。\n" +
                "2.1905年至1907年资产阶级革命派与改良派的论战及其意义。=(1）论战的主要内容：①要不要以革命手段推翻清政府。这是论战的焦点；革命派控诉清政府卖国媚外的罪行，强调救国必先推翻清王朝；革命派还反驳了改良派提出的革命会招致天下大乱和帝国主义干涉之谬论。②要不要推翻帝制，实行共和；③要不要社会革命。（2）重要意义：①划清了革命与改良的界限；②使资产阶级民主思想和三民主义思想得到了更加广泛的传播，为推翻清朝统治的革命斗争奠定了思想基础。\n" +
                "3.1912年建立的中华民国临时政府的性质。=(1）是资产阶级共和国性质的革命政权。①在人员构成上，资产阶级革命派控制着这个政权。②在实行的各项政策措施上，集中体现了中国民族资产阶级的愿望和利益，也一定程度上符合广大中国人民的利益。③1912年3月，临时参议院颁布的《中华民国临时约法》是中国历史上第一部具有资产阶级共和国宪法性质的法典。\n" +
                "5.简述辛亥革命胜利的历史意义。=(1）它推翻了清王朝在中国的统治，沉重打击了中外反动势力在中国的统治；（2）宣告了封建君主专制制度的结束和民国的建立；（3）传播了民主共和的理念，推动了思想解放；（4）促使社会经济、思想习惯和社会风俗等方面发生了新的变化；（5）打击帝国主义在华势力，为亚洲各国人民的革命斗争提供范例，推动了亚洲各国民族解放运动的高涨。\n" +
                "6.以孙中山为首的资产阶级革命派反对北洋军阀统治的主要斗争。=(1）发动“二次革命”（2）组织中华革命党。（3）发动护国运动。（4）发动第一次护法运动。（5）发动第二次护法运动。第四章 开天辟地的大事变\n" +
                "1.简述五四运动前新文化运动的历史意义。=(1）是资产阶级民主主义新文化同封建主义旧文化的斗争，辛亥革命在思想文化领域的延续，沉重打击封建专制主义。（2）大力宣传了民主和科学，将人们从封建专制所造成的蒙昧中解放出来，开启了思想解放的潮流。（3）为中国先进分子接受马克思主义准备了适宜的土壤，为以五四运动为开端的中国新民主主义革命创造了思想文化上的条件。\n" +
                "2.五四以前新文化运动的局限。=(1）没有揭示封建专制主义得以存在的社会根源；把资产阶级共和国方案失败的根本原因归之于思想文化，是错误的。（2）他们把改造国民性置于优先地位，但是又脱离改造产生封建思想的社会环境的革命实践，没有把运动普及到工农群众中去，仅仅依靠少数人的呐喊，其目标就难以实现。（3）少数人在思想方法上存在绝对肯定或绝对否定的形式主义偏向。\n" +
                "3.简述五四运动爆发的社会历史条件。=(1）它发生在俄国十月革命所开辟的世界无产阶级社会主义革命的新时代。（2）新的社会力量的成长。第一次世界大战期间，中国的民族资本主义经济得到短暂而又迅速的发展。中国的工人阶级和民族资产阶级的力量进一步壮大起来。（3）新文化运动掀起的思想解放潮流的推动，为五四运动准备了群众基础和骨干力量。\n" +
                "4.五四运动的历史特点及意义。=(1）是中国近代史上一次彻底的反帝反封建的革命运动，把中国人民反帝反封建的斗争提升到一个新的水平线上。（2）五四运动广泛地动员和组织了群众，是一场真正的群众性的革命运动。青年学生起了先锋作用，工人阶级第一次作为独立的政治力量登上政治舞台，运动后期发挥主力军作用。（3）五四运动促进了马克思主义学员专用 请勿外泄4中公学员内部专用在中国的广泛传播，促进了马克思主义同中国工人运动的结合，为中国共产党成立作了思想和干部上的准备。（4）五四运动是中国新民主主义革命的开端。五四运动后，无产阶级代替资产阶级成为中国革命领导者。\n" +
                "5.早期马克思主义在中国得到广泛传播的表现。=(1）马克思主义著作的翻译和出版。（2）研究和宣传马克思主义的社团纷纷涌现。（3）大量进步刊物的创办。\n" +
                "6.中国早期马克思主义信仰者的三种类型及其代表人物。=(1）五四运动前的新文化运动的精神领袖。其代表是李大钊、陈独秀。（2）五四运动中的左翼骨干，其代表为毛泽东、杨匏安、蔡和森、周恩来等。（3）一部分原中国同盟会会员、辛亥革命时期的活动家，其代表为董必武、林伯渠、吴玉章等。\n" +
                "7.简述各地共产党早期组织成立后的工作。=(1）研究和宣传马克思主义。（2）到工人中去开展宣传和组织工作。（3）进行关于建党问题的讨论和实际组织工作。\n" +
                "8.试述中国共产党成立的历史特点。=(1）成立于俄国十月革命胜利和第二国际修正主义破产之后，按照列宁的建党原则建立起来的。它所接受的是没有被修正主义阉割的马克思主义的完整的科学世界观和社会革命论。（2）它是在半殖民地半封建中国的工人运动基础上产生的。\n" +
                "9.简述中共二大的主要内容。=(1）中共二大在中国近代史上第一次明确提出了反帝反封建的民主革命纲领；（2）解决了分清敌友这个革命的首要问题；（3）提出新的革命方法是走群众路线。\n" +
                "10.中国国民党第一次全国代表大会对三民主义的新阐述是什么？（新三民主义的内容）=(1）民族主义突出了反对帝国主义的内容，强调对外争取中华民族的完全独立，同时主张国内各民族一律平等；（2）民权主义强调民权为一般平民所共有，不应为“少数人所得而私”；（3）民生主义在“平均地权”基础上增加了“节制资本”的原则，并提出改善工农的生活状况。这样，旧三民主义发展成为新三民主义。\n" +
                "11.1926年至1927年，北伐战争直接打击的目标和战略方针。=(1）北伐的直接目标是打倒帝国主义支持的北洋军阀。（2）集中兵力、各个歼灭的战略方针：①首先以主力进军两湖，消灭吴佩孚；②然后引兵东向，消灭孙传芳；③最后，北上解决张作霖。\n" +
                "12.简述北伐战争得以胜利进军的原因。=(1）国共合作的实现，革命统一战线的建立。（2）北伐战争是反对帝国主义和封建军阀的正义的革命战争，得到广大工农群众的大力支持。（3）北伐战争得到苏联政府的多方面援助。\n" +
                "13.简述国民革命失败的原因.=(1）客观原因：①敌我力量悬殊，反革命力量十分强大；②革命统一战线内部出现剧烈分化。（2）主观原因：①以陈独秀为首的中共中央的右倾机会主义错误。②党处于幼年时期。③共产国际的错误指导。\n" +
                "14.简述国民革命的意义。=(1）沉重打击了帝国主义和封建主义的统治势力，中国人民的觉悟程度和组织程度有了明显的提高，实际上是迎接未来革命胜利的一次伟大演习。（2）扩大了中国共产党在中国人民中的政治影响，宣传了党在民主革命阶段的纲领，使党经受了一次大革命的洗礼，积累了初步的经验。学员专用 请勿外泄5中公学员内部专用第五章 中国革命的新道路\n" +
                "1.简述中国民族资本主义经济的特点。=(1）民族资本主义经济在国民经济中所占比重很小。（2）在民族资本中，工业资本所占的比重小。（3）企业规模狭小、技术设备落后、劳动生产率低。（4）民族资本主义工业主要是以纺织、食品等轻工业为主，缺乏重工业的基础。（5）和外国垄断资本、本国官僚资本以及封建势力有千丝万缕的联系。\n" +
                "2.简述中共八七会议的主要内容和意义。=(1）内容：①清算了大革命后期陈独秀右倾投降主义错误，确定了土地革命和武装斗争总方针。②选出以瞿秋白为书记的中央临时政治局。③毛泽东阐述了农民问题和武装斗争对革命的重要性，强调“政权是由枪杆子中取得的”。（2）意义：①给正处在思想混乱和组织涣散中的中国共产党指明了出路；②由大革命失败到土地革命战争兴起的历史转折点。\n" +
                "3简述南昌起义的历史意义。=(1）打响了武装反抗国民党反动统治的第一枪，体现了中国共产党人为实行中国人民的根本利益和中华民族的解放事业而前赴后继的革命精神；（2）成为共产党独立领导革命战争、创建人民军队和武装夺取政权的伟大开端；（3）揭开了土地革命战争的序幕。\n" +
                "4.简述秋收起义的特点。=(1）它放弃了“左派国民党”运动的旗号，公开打出了“工农革命军”的旗帜；（2）它不仅是军队的行动，而且有数量众多的工农武装参加。\n" +
                "5.简述“三湾改编”的内容及意义。=(1）内容：①将原有的一个师缩编为一个团；②在部队中建立共产党各级组织，将党的支部建在连上；③成立各级士兵委员会，部队内部实行民主管理。（2）意义：是建设党领导的新型人民军队的重要开端。\n" +
                "6.试述红色政权存在和发展的原因和条件。=(1）根本原因：中国是被几个帝国主义国家间接统治且政治经济发展极端不平衡的半殖民地半封建的大国。（2）客观条件：①国民革命的影响；②全国革命形势的继续发展。（3）主观条件：相当力量的正式红军的存在；共产党组织的坚强有力和各项政策的正确贯彻执行。\n" +
                "7.试述古田会议内容和意义。=(1）内容：①确立了思想建党、政治建军原则，要求必须加强政治工作；②必须加强思想和政治路线的教育，纠正党内的错误思想。（2）意义：创造性地解决了在农村环境中、在党组织和军队以农民为主要成分的环境下，如何从加强思想建设入手，保持党的无产阶级先锋队性质和建设党领导的新型人民军队的问题，这是人民军队完全区别于一切旧军队的政治特质和根本优势，对于中国革命新道路的开辟和坚持具有重要的意义。\n" +
                "8.20世纪30年代党内发生的三次“左”倾错误。=(1）1927年11月至1928年4月的以瞿秋白为代表的“左”倾盲动错误；（2）1930年6月至9月以李立三为代表的“左”倾冒险主义；（3）1931年1月至1935年1月以陈绍禹（王明）为代表的“左”倾教条主义。\n" +
                "9.造成党内左倾错误原因。=(1）八七会议以后，党内一直存在着的浓厚的近乎拼命的冲动。（2）全党的马克思理论准备不足，理论素养还不高，实践经验也很缺乏。（3）共产国际的干预以及对王明的全力支持。\n" +
                "10.遵义会议集中解决的主要问题及其意义。=(1）会议集中全力解决了当时具有决定意义的军事和组织问题；（2）意义：①在极其危急的情况下挽救了中国共产党、挽救了中国工农红军、挽救了中国革命，开学员专用 请勿外泄6中公学员内部专用始确立了以毛泽东为代表的新的中央的领导，成为中国共产党历史上一个生死攸关的转折点。为党和革命事业转危为安、不断打开新局面提供了最重要的保证。②标志着中国共产党在政治上走向成熟。（3）证明中国共产党是具有自我净化和自我发展的能力的，通过总结成功的经验和失误的教训，不断地把党及党所领导的革命事业不断推向前进。\n" +
                "1.长征的胜利及其伟大意义。=(1）长征粉碎了国民党“围剿”红军、消灭革命力量的企图，是中国革命转危为安的关键。（2）通过长征，把中国革命的大本营放在了西北，为迎接中国人民抗日救亡的新高潮准备条件。（3）长征保存并锤炼了中国革命的骨干力量。（4）长征铸就了伟大的长征精神。（5）长征播撒了革命的火种。第六章 中华民族的抗日战争\n" +
                "1.简述一二·九远动及其历史意义。=(1）华北事变后，1935年12月9日，在中国共产党救亡图存、全民抗战的号召和中共北平临时工作委员会的领导下，北平学生举行声势浩大的抗日游行。史称一二·九运动。（2）意义：打击了日本帝国主义侵略中国并吞并华北的计划，促进了中华民族的觉醒，标志省中国人民抗日救运动新高潮的到来。\n" +
                "2.西安事变及其和平解决的意义。=(1）1936年12月12日，爱国将领张学良、杨虎城实行“兵谏”，发动西安事变。中共中央派周恩来等参加张、杨同南京方面的代表宋美龄、宋子文等人的和平谈判。经过谈判，终于迫使蒋介石做出了停止剿共，联合红军抗日等六项承诺。（2）西安事变的和平解决成为局势扭转的枢纽，十年内战的局面结束，国内和平基本实现。这为国共两党的合作抗日创造了有利条件。\n" +
                "3.中国共产党在全民族抗战中的中流砥柱作用。=(1）中国共产党自成立之日起就把实现中华民族伟大复兴作为自己的历史使命。（2）在抗日战争时期，中国共产党坚持全面抗战路线，制定正确战略策略，开辟广大敌后战场，成为坚持抗战的中坚力量；（3）始终坚持抗战、反对投降，坚持团结、反对分裂，坚持进步、反对倒退，同各爱国党派团体和广大人民一起，共同维护团结抗战大局。\n" +
                "4.毛泽东在《论持久战》一文中对中日双方互相矛盾的四个特点的分析。=(1）指出中日战争是半殖民地半封建的中国和帝国主义的日本之间在20世纪30年代进行的一个决死的战争。（2）中日双方互相矛盾的四个特点：敌强我弱，敌小我大，敌退步我进步，敌寡助我多助。一方面，日本是强国，中国是弱国，强国弱国的对比，决定了抗日战争只能是持久战。另一方面，日本是小国，发动的是退步的、野蛮的侵略战争，在国际上失道寡助；而中国是大国，进行的是进步的、正义的反侵略战争，在国际上得道多助。中国已经有了代表中华民族和中国人民根本利益的共产党及其领导的人民军队和抗日根据地。因此，最后胜利是中国的。\n" +
                "5.简述中国共产党制定的抗日民族统一战线的策略总方针。=(1）发展进步势力（中心环节），争取中间势力，孤立顽固势力。（2）进步势力主要是指工人、农民和城市小资产阶级。他们是统一战线的基础，抗日战争的主要依靠力量。（3）中间势力主要是民族资产阶级、开明绅士和地方实力派。争取中间势力需要一定的条件：共产党有充足的力量；尊重他们的利益；同顽固派作斗争并取得胜利。（4）顽固势力是指以蒋介石集团为代表的抗日国民党亲英美派。同他们做斗争时应采取两面政策：坚持联合又斗争，斗争中做到有理、有利、有节。学员专用 请勿外泄7中公学员内部专用\n" +
                "6.简述抗日民主根据地的建设。=(1）抗日根据地的政权建设，是抗日根据地建设的首要的、根本的任务。（2）开展大生产运动，克服经济困难。（3）发展抗日文化事业，培养抗日骨干。\n" +
                "7.试述抗日战争胜利的意义。=(1）彻底粉碎了日本军国主义殖民奴役中国的图谋，捍卫了中国的国家主权和领土完整，洗刷了民族耻辱。（2）重新确立了中国在世界上的大国地位，赢得了世界爱好和平人民的尊敬，赢得了崇高的民族声誉。（3）促进了中华民族的觉醒，开辟了中华民族伟大复兴的光明前景，并为共产党领导人民取得整个新民主主义革命的胜利奠定了基础。\n" +
                "8.试述抗日战争胜利的意义。=(1）以爱国主义为核心的伟大民族精神是中国人民抗日战争胜利的决定因素；（2）中国共产党的中流砥柱作用是中国人民抗日战争胜利的关键；（3）全民族抗战是中国人民抗日战争胜利的重要法宝；（4）世界所有爱好和平和正义的国家的支持，是中国人民抗日战争胜利的国际条件。\n" +
                "9.中国人民抗日战争在世界反法西斯战争中的地位。=(1）中国人民抗日战争是世界反法西斯战争的东方主战场。（2）大大减轻了其他战场的压力，为盟军完成战略转折和实施战略反攻创造了有利条件。（3）中国作为亚太地区盟军对日作战的重要后方基地，为盟国提供了大量战略物资和军事情报。第七章 为创建新中国而奋斗\n" +
                "1.抗日战争胜利后的三种建国方案。=(1）代表地主阶级与买办性的大资产阶级的建国方案；（2）代表民族资产阶级的建国方案；（3）工人阶级、农民阶级和城市小资产阶级的建国方案，即建立一个工人阶级领导的、工农联盟为基础的、人民民主专政的人民共和国。这三个阶级的政治代表是中国共产党。\n" +
                "2.简述新民主主义革命的三大经济纲领和新民主主义革命阶段的总路线。=(1）新民主主义革命的三大经济纲领：没收封建阶级的土地归农民所有；没收蒋介石、宋子文、孔祥熙、陈立夫为首的垄断资本归新民主主义的国家所有；保护民族工商业。（2）新民主主义革命的总路线：新民主主义革命阶段的总路线，即无产阶级领导的，人民大众的，反对帝国主义、封建主义和官僚资本主义的革命。\n" +
                "3.试论述土地改革总路线以及土地改革运动的意义。=(1）总路线：依靠贫农、团结中农，有步骤地、有分别地消灭封建剥削制度，发展农业生产。（2）意义：①广大农民对中国共产党更加信任和拥护，工农联盟以及解放区的人民民主政权得到进一步巩固和加强；（2）广大农民从封建的生产关系中解放出来，生产积极性空前提高，解放区农村的经济面貌得到明显改观；（3）大批青壮年农民踊跃参军，配合解放军作战，人民解放战争有了巩固的后方和最基本的人力、物力保证。\n" +
                "4.中共七届二中全会的主要内容。=(1）规定了全国胜利后中国共产党在政治、经济、外交方面应当采取的基本政策。（2）指出中国由农业国变为工业国、由新民主主义社会变为社会主义社会的发展方向。（3）在中国共产党自身建设的问题上，提出了“两个务必”的要求。务必使同志们继续地保持谦虚、谨慎、不骄、不躁的作风，务必使同志们继续地保持艰苦奋斗的作风。\n" +
                "5.《论人民民主专政》关于建立人民民主专政的新中国的主张。=(1）人民民主专政的基础是工人阶级、农民阶级和城市小资产阶级的联盟。（2）在上述联盟中，主要是工学员专用 请勿外泄8中公学员内部专用农联盟。（3）为建立新中国，要团结民族资产阶级，但民族资产阶级不能充当革命的领导者，也不应当在国家政权中占主要的地位。\n" +
                "6.《共同纲领》中规定的新中国的经济工作方针。=(1）以公私兼顾、劳资两利、城乡互助、内外交流的政策，达到发展生产、繁荣经济之目的。（2）国家应调剂国营经济、个体经济、私人资本主义经济等，使各种社会经济成分在国营经济领导之下，分工合作，各得其所，以促进整个社会经济发展。\n" +
                "7.中国革命（新民主主义革命）胜利的基本经验。=(1）建立广泛统一战线。建立广泛的统一战线，是坚持和发展革命的政治基础。统一战线存在着两个联盟：一个是劳动者联盟，主要是工人、农民和城市小资产阶级的联盟，这是基本的、主要的；一个是劳动者与非劳动者的联盟，主要是劳动者与民族资产阶级的联盟。必须坚决依靠第一个联盟，争取建立和扩大第二个联盟。巩固和扩大统一战线的关键，是坚持工人阶级及其政党的领导权。（2）坚持革命的武装斗争。中国革命只能以长期的武装斗争作为主要形式。中国的武装斗争实质上是工人阶级领导的农民战争，通过农村包围城市、武装夺取政权的道路来取得革命胜利。（3）加强共产党自身建设。首先着重党思想建设，党内斗争中实行“惩前毖后，治病救人”的方针、以批评与自我批评进行马克思主义思想教育的整风形式等。第八章 社会主义基本制度的全面确立\n" +
                "1.简述新中国成立初期执政面临的严峻挑战。=(1）能不能保卫住人民胜利的成果，巩固新生的人民政权；（2）能不能战胜严重的经济困难，迅速恢复和发展国民经济；（3）能不能巩固民族独立，维护国家主权和安全；（4）能不能经受住执政的考验，继续保持谦虚、谨慎、不骄、不躁的作风和艰苦奋斗的作风。\n" +
                "2.没收官僚资本对新中国国民经济发展的作用。=(1）削弱了资本主义经济的力量。（2）壮大了社会主义国营经济。\n" +
                "3.七届三中全会（毛泽东）提出的获得经济情况根本好转的三个条件。=(1）土地改革的完成；（2）现有工商业的调整；（3）国家机构所需经费的大量节俭。\n" +
                "4.简述国民经济迅速恢复的原因。=(1）中共中央和人民政府紧紧抓住恢复和发展生产作为一切工作的中心，正确处理恢复国民经济同其他各项工作的关系；（2）从当时国情出发，对国家财经实行集中和统一的管理，制定了“不要四面出击”等正确方针政策，妥善处理了公私关系、劳资关系等各种社会关系；（3）中国共产党加强自身建设，保持和发扬党的优良传统和作用，抵制了资产阶级的腐蚀。\n" +
                "5.新中国1949-1952年采取的向社会主义过渡的实际步骤。=(1）没收官僚资本，确立社会主义性质的国营经济的领导地位。（2）开始将资本主义纳入国家资本主义轨道。（3）引导个体农民在土地改革后逐步走上互助合作的道路。\n" +
                "6.过渡时期总路线的内容和特点。=(1）总路线的内容：要在一个相当长的时期内，逐步实现国家的社会主义工业化，并逐步实现国家对农业、手工业和资本主义工商业的社会主义改造。（2）特点：这是一条“一化三改”、“一体两翼”的总路线，即社会主义建设同社会主义改造同时并举的总路线，体现了发展生产力和变革生产关系的有机统一。学员专用 请勿外泄9中公学员内部专用\n" +
                "7.过渡时期总路线为什么反映了历史的必然？=(1）社会主义性质的国营经济力量相对来说比较强大，它是实现国家工业化的主要基础；（2）资本主义经济力量弱小，发展困难，不可能成为中国工业起飞的基础。而国家资本主义的实践为对资本主义工商业进行社会主义改造积累了初步的经验；（3）对个体农业进行社会主义改造，是保证工业发展、实现国家工业化的一个必要条件；（4）当时的国际环境也促使中国选择社会主义。\n" +
                "8.中国共产党对农业合作化运动的指导方针的基本原则和方针。=(1）在中国条件下，可以走先合作化、后机械化的道路；（2）充分利用发挥土改后农民的两种生产积极性，通过由低到高的互助合作组织形式，实行积极发展、稳步前进、逐步过渡的方针；（3）农业互助合作的发展，要坚持自愿和互利的原则，采取典型示范、逐步推广的方法，发展一批，巩固一批；（4）要始终把是否增产作为衡量合作社是否办好的标准；（5）要把社会改造同技术改造相结合。\n" +
                "9.对资本主义工商业采取和平赎买政策的特点。=(1）有偿地而不是无偿地，逐步地而不是突然地改变资产阶级的所有制；（2）在改造他们的同时，给予他们以必要的工作安排；（3）不剥夺资产阶级的选举权，并且对于他们中间积极拥护社会主义改造而在这个改造事业中有所贡献的代表人物给以恰当的政治安排。\n" +
                "10.社会主义改造基本完成的意义。=(1）随着社会主义改造的基本完成，中国继建立了社会主义基本政治制度以后，社会主义的基本经济制度也建立起来了，这是中国进入社会主义社会的最主要标志。表明中国已经胜利地完成了从新民主主义到社会主义的过渡，社会主义基本制度在中国全面确立。（2）社会主义改造是在生产关系方面由私有制到公有制的一场伟大的变革，这就使社会生产力从旧的生产关系的束缚中解放出来，对生产力的发展直接起到了促进作用。（3）通过社会主义改造，中国共产党创造性地完成了由新民主主义到社会主义的过渡，实现了中国历史上最伟大最深刻的社会变革，开始了在社会主义道路上实现中华民族伟大复兴的历史征程。第九章 社会主义建设在探索中曲折发展\n" +
                "1.《论十大关系》提出的基本方针和意义。=(1）基本方针：“一定要努力把党内党外、国内国外的一切积极的因素，直接的、间接的积极因素，全部调动起来，把我国建设成为一个强大的社会主义国家。” （2）①中国共产党人开始探索中国自己的社会主义建设道路的标志；②在新的历史条件下从经济方面和政治方面提出了新的指导方针；③为中共八大的召开作了理论准备。\n" +
                "2.中共八大如何分析我国社会主义改造完成后国内的主要矛盾和主要任务。=(1）我国国内主要矛盾，已经是人民对于建立先进的工业国的要求同落后的农业国的现实之间的矛盾，已经是人民对于经济文化迅速发展的需要同当前经济文化不能满足人民需要的状况之间的矛盾。（2）主要任务是集中力量来解决这个矛盾，把我国尽快地从落后的农业国变为先进的工业国。\n" +
                "3.陈云“三个主体、三个补充”的思想。=(1）国家经营和集体经营是主体，一定数量的个体经营为补充；（2）计划生产是主体，一定范围的自由生产为补充；（3）国家市场是主体，一定范围的自由市场为补充。\n" +
                "4.新中国社会主义建设取得的成就。=(1）独立的、比较完整的工业体系和国民经济体系的基本建立。（2）人民生活水平的提高与文化、医疗、学员专用 请勿外泄10中公学员内部专用科技事业的发展。（3）国际地位的提高与国际环境的改善。\n" +
                "5.毛泽东等老一代革命家探索中国社会主义建设道路在经济建设方面的理论贡献。=(1）要正确处理重工业、轻工业和农业的关系，以农、轻、重为序发展国民经济；（2）在优先发展重工业的条件下，坚持工业和农业并举、重工业和轻工业并举、中央工业和地方工业并举、大中小企业并举等“两条腿走路”的方针；（3）正确解决好综合平衡的问题，处理好积累和消费、生产和生活的问题；（4）处理好国家、集体和个人的关系，统筹兼顾，适当安排。\n" +
                "6.毛泽东等老一代革命家探索中国社会主义建设道路在民主政治建设方面的理论贡献。=(1）我们的目标是造成一个又有集中又有民主，又有纪律又有自由，又有统一意志，又有个人心情舒畅、生动活泼，那样一种政治局面；（2）要把正确处理人民内部矛盾作为国家政治生活的主题，坚持人民民主，尽可能团结一切可以团结的力量；（3）处理好中共同各民主党派的关系，坚持长期共存、互相监督的方针，巩固和扩大爱国统一战线；（4）要切实保障人民当家作主的各项权利，尤其是人民参与国家和社会事务管理的权利；（5）社会主义法制要保护劳动人民的利益，保护社会主义经济基础，保护社会生产力。第十章 中国特色社会主义的开创与接续发展\n" +
                "1.简述1978年关于真理标准问题的讨论的意义。=(1）这一讨论冲破了“两个凡是”的思想束缚，是一场马克思主义的思想解放运动，成为拨乱反正和改革开放的思想先导。（2）关于真理标准问题的大讨论，是继延安整风之后又一场马克思主义思想解放运动，成为拨乱反正和改革开放的思想先导，为党重新确立实事求是的思想路线，纠正长期以来的“左”倾错误，实现历史性的转折作了思想理论准备。\n" +
                "2.简述十一届三中全会的意义。=(1）重新确立了马克思主义实事求是的思想路线。（2）全面分析了当前的主要矛盾和主要任务，作出了把工作重点转移到社会主义现代化建设上来和实行改革开放的战略决策。（3）全会恢复了党的民主集中制优良传统，审查解决了历史上遗留的一批重大问题和一些重要领导人功过是非问题。（4）为了适应社会主义现代化建设的需要全会决定在党的生活和国家政治生活中加强民主，明确党思想路线，加强党的领导机构和成立中央纪律检查委员会。（5）是新中国成立以来党的历史上具有深远意义的伟大转折，是改革开放和社会主义现代化建设新时期的起点。\n" +
                "3.简述四项基本原则的内容及意义。=(1）坚持社会主义道路；坚持人民民主专政；坚持共产党的领导；坚持马克思列宁主义、毛泽东思想。（2）四项基本原则是实现四个现代化的根本前提。如果动摇了这四项基本原则中的任何一项，那就动摇了整个社会主义事业。四项基本原则为保证改革开放和现代化建设事业的顺利进行，提供了可靠的政治基础，指明了正确的方向。\n" +
                "4.社会主义初级阶段的含义及基本路线。=(1）含义：①我国社会已经是社会主义社会；②我国的社会主义社会还处在初级阶段。（2）基本路线：领导和团结全国各族人民，以经济建设为中心，坚持四项基本原则，坚持改革开放，自力更生，艰苦创业，为把我国建设成为富强、民主、文明的社会主义现代化国家而奋斗。第十一章 中国特色社会主义进入新时代学员专用 请勿外泄11中公学员内部专用\n" +
                "1.中国特色社会主义的总依据、总布局和总任务是什么？。=(1）总依据是社会主义初级阶段；（2）总布局是经济、政治、文化、社会、生态文明建设五位一体；（3）总任务是实现社会主义现代化和中华民族伟大复兴。\n" +
                "2.什么是“五位一体”总体布局？=(1）主动适应和引领经济发展新常态；（2）发展社会主义民主政治；（3）发展中国特色社会主义文化；（4）在发展中保障和改善民生；（5）建设美丽中国。\n" +
                "3.什么是“四个全面”战略布局？=(1）推进全面深化改革；（2）推进全面依法治国；（3）推进全面建成小康社会；（4）推进全面从严治党。\n" +
                "4.十八大后党和国家事业的历史性成就和历史性变革给我们的启示。=(1）必须始终坚持用党的理论创新成果武装头脑、指导实践，以习近平新领时代中国特色社会主义思想为奋斗的行动指南。（2）必须始终维护党中央和全党的核心习近平总书记。（3）必须始终坚持和加强党的全面领导。\n" +
                "5.简述中国特色社会主义进入新时代的意义。=(1）意味着近代以来久经磨难的中华民族迎来了从站起来、富起来到强起来的伟大飞跃，迎来了实现中华民族伟大复兴的光明前景。（2）意味着科学社会主义在21世纪的中国焕发出强大生机活力，在世界上高高举起了中国特色社会主义伟大旗帜。（3）意味着中国特色社会主义道路、理论、制度、文化不断发展，拓展了发展中国家走向现代化的途径，给世界上那些既希望加快发展又希望保持自身独立性的国家和民族提供了全新选择，为解决人类问题贡献了中国智慧和中国方案。\n";
        str = str.replace("\"","");
//        System.out.println(str);
        for (String s : str.split("\n")){
            String [] arr = s.split("=");
            System.out.println(",[\""+arr[0]+"\",\""+arr[1]+"\"]");
        }
    }
}
